# pandas ==>open source liabrary that is used for handle data manipulations.
data structure of pandas ==>
#1. series ===> it is used for one dimensional data.it shows only value of a columnand it will not include column name.
#2. data frame ===> it is multi-dimensional data. it shows column name with values

In [8]:
import pandas as pd

In [9]:
a = pd.Series([1,34,78,90])
a

0     1
1    34
2    78
3    90
dtype: int64

# (2). data frame ===>

In [11]:
a = {
    "EMP_ID" : [1,2,3,4,5,6,7,8],
    "NAME" : ['Sam' ,'Rahul' , 'Gaurav' , 'Aniket' ,'Anjali' ,'Pooja' , 'Muskan' , 'Raja'],
    "DEPARTMENT" : ['IT' ,'HR' ,'IT' ,'HR','IT','HR','IT','HR'],
    "SALARY" : [25000,27000,26000,23000,34000,32000,45000,56000],
    "WORKING_HOURS" : [8,9,7,8,9,7,8,9]
}

In [12]:
type(a)

dict

In [13]:
df = pd.DataFrame(a)
df

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3  Gaurav         IT   26000              7
3       4  Aniket         HR   23000              8
4       5  Anjali         IT   34000              9
5       6   Pooja         HR   32000              7
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

# how to check top 5 data from a dataframe

In [14]:
df.head()

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3  Gaurav         IT   26000              7
3       4  Aniket         HR   23000              8
4       5  Anjali         IT   34000              9

In [15]:
df.head(2)

   EMP_ID   NAME DEPARTMENT  SALARY  WORKING_HOURS
0       1    Sam         IT   25000              8
1       2  Rahul         HR   27000              9

# how to check bottom data

In [19]:
df.tail()

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
3       4  Aniket         HR   23000              8
4       5  Anjali         IT   34000              9
5       6   Pooja         HR   32000              7
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

In [20]:
df.tail(3)

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
5       6   Pooja         HR   32000              7
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

In [21]:
df.tail(2)

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

# how can we check random indexed data

In [16]:
df.sample(3)

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
3       4  Aniket         HR   23000              8
0       1     Sam         IT   25000              8
6       7  Muskan         IT   45000              8

# how to export our data

In [18]:
df.to_csv("C:\\Users\\snehr\\Desktop\\shubhi pdfs\\emp_info.csv")

# step-1 (df.to_csv(" ")) 

# step-2  Create a new folder ==> copy location ===> paste it into step-1 
# df.to_csv("folder_location\\filename.csv")

In [7]:
import pandas as pd

In [8]:
df = pd.read_csv("C:\\Users\\snehr\\Desktop\\Datasets for pandas (24-05-2024)_files\\covid_toy.csv")

In [3]:
df.head(2)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes

In [4]:
df.head(4)

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No

In [10]:
df.tail()

    age  gender  fever   cough       city has_covid
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

In [9]:
df.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [12]:
top_left_corner_df = df.iloc[:5 , :4]
top_left_corner_df

   age  gender  fever cough
0   60    Male  103.0  Mild
1   27    Male  100.0  Mild
2   42    Male  101.0  Mild
3   31  Female   98.0  Mild
4   65  Female  101.0  Mild

In [13]:
s =   df.axes
s

[RangeIndex(start=0, stop=100, step=1),
 Index(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'], dtype='object')]

In [14]:
p = df.dtypes
p

age            int64
gender        object
fever        float64
cough         object
city          object
has_covid     object
dtype: object

In [15]:
b = df.empty
b

False

In [16]:
i = df.ndim   #number of axes (it is 2) 
i

2

In [17]:
t = df.shape 
t

(100, 6)

In [18]:
d = df.size          # row count * column count 
d

600

In [19]:
a = df.values    # get a numpy array for df 
a

array([[60, 'Male', 103.0, 'Mild', 'Kolkata', 'No'],
       [27, 'Male', 100.0, 'Mild', 'Delhi', 'Yes'],
       [42, 'Male', 101.0, 'Mild', 'Delhi', 'No'],
       [31, 'Female', 98.0, 'Mild', 'Kolkata', 'No'],
       [65, 'Female', 101.0, 'Mild', 'Mumbai', 'No'],
       [84, 'Female', nan, 'Mild', 'Bangalore', 'Yes'],
       [14, 'Male', 101.0, 'Strong', 'Bangalore', 'No'],
       [20, 'Female', nan, 'Strong', 'Mumbai', 'Yes'],
       [19, 'Female', 100.0, 'Strong', 'Bangalore', 'No'],
       [64, 'Female', 101.0, 'Mild', 'Delhi', 'No'],
       [75, 'Female', nan, 'Mild', 'Delhi', 'No'],
       [65, 'Female', 98.0, 'Mild', 'Mumbai', 'Yes'],
       [25, 'Female', 99.0, 'Strong', 'Kolkata', 'No'],
       [64, 'Male', 102.0, 'Mild', 'Bangalore', 'Yes'],
       [51, 'Male', 104.0, 'Mild', 'Bangalore', 'No'],
       [70, 'Male', 103.0, 'Strong', 'Kolkata', 'Yes'],
       [69, 'Female', 103.0, 'Mild', 'Kolkata', 'Yes'],
       [40, 'Female', 98.0, 'Strong', 'Delhi', 'No'],
       [64, 'Female', 98.0, 'Mild', 'Bangalore', 'Yes'],
       [42, 'Female', nan, 'Strong', 'Bangalore', 'Yes'],
       [12, 'Male', 98.0, 'Strong', 'Bangalore', 'No'],
       [73, 'Male', 98.0, 'Mild', 'Bangalore', 'Yes'],
       [71, 'Female', 98.0, 'Strong', 'Kolkata', 'Yes'],
       [80, 'Female', 98.0, 'Mild', 'Delhi', 'Yes'],
       [13, 'Female', 100.0, 'Strong', 'Kolkata', 'No'],
       [23, 'Male', nan, 'Mild', 'Mumbai', 'No'],
       [19, 'Female', 100.0, 'Mild', 'Kolkata', 'Yes'],
       [33, 'Female', 102.0, 'Strong', 'Delhi', 'No'],
       [16, 'Male', 104.0, 'Mild', 'Kolkata', 'No'],
       [34, 'Female', nan, 'Strong', 'Mumbai', 'Yes'],
       [15, 'Male', 101.0, 'Mild', 'Delhi', 'Yes'],
       [83, 'Male', 103.0, 'Mild', 'Kolkata', 'No'],
       [34, 'Female', 101.0, 'Strong', 'Delhi', 'Yes'],
       [26, 'Female', 98.0, 'Mild', 'Kolkata', 'No'],
       [74, 'Male', 102.0, 'Mild', 'Mumbai', 'Yes'],
       [82, 'Female', 102.0, 'Strong', 'Bangalore', 'No'],
       [38, 'Female', 101.0, 'Mild', 'Bangalore', 'No'],
       [55, 'Male', 100.0, 'Mild', 'Kolkata', 'No'],
       [49, 'Female', 101.0, 'Mild', 'Delhi', 'Yes'],
       [50, 'Female', 103.0, 'Mild', 'Kolkata', 'No'],
       [49, 'Female', 102.0, 'Mild', 'Delhi', 'No'],
       [82, 'Male', nan, 'Mild', 'Kolkata', 'Yes'],
       [27, 'Male', 100.0, 'Mild', 'Delhi', 'Yes'],
       [22, 'Female', 99.0, 'Mild', 'Bangalore', 'Yes'],
       [20, 'Male', 102.0, 'Strong', 'Delhi', 'No'],
       [72, 'Male', 99.0, 'Mild', 'Bangalore', 'No'],
       [19, 'Female', 101.0, 'Mild', 'Mumbai', 'No'],
       [18, 'Female', 104.0, 'Mild', 'Bangalore', 'No'],
       [66, 'Male', 99.0, 'Strong', 'Bangalore', 'No'],
       [44, 'Male', 104.0, 'Mild', 'Mumbai', 'No'],
       [19, 'Male', 101.0, 'Mild', 'Delhi', 'Yes'],
       [11, 'Female', 100.0, 'Strong', 'Kolkata', 'Yes'],
       [47, 'Female', 100.0, 'Strong', 'Bangalore', 'Yes'],
       [83, 'Male', 98.0, 'Mild', 'Delhi', 'Yes'],
       [60, 'Female', 99.0, 'Mild', 'Mumbai', 'Yes'],
       [81, 'Female', 101.0, 'Mild', 'Mumbai', 'Yes'],
       [71, 'Male', nan, 'Strong', 'Kolkata', 'No'],
       [49, 'Female', 99.0, 'Strong', 'Bangalore', 'No'],
       [23, 'Male', 98.0, 'Strong', 'Mumbai', 'Yes'],
       [6, 'Female', 104.0, 'Mild', 'Kolkata', 'Yes'],
       [24, 'Female', 102.0, 'Strong', 'Bangalore', 'Yes'],
       [81, 'Female', 98.0, 'Strong', 'Mumbai', 'No'],
       [56, 'Female', 104.0, 'Strong', 'Bangalore', 'Yes'],
       [10, 'Male', 100.0, 'Mild', 'Bangalore', 'No'],
       [42, 'Male', 104.0, 'Mild', 'Mumbai', 'No'],
       [69, 'Female', 102.0, 'Mild', 'Bangalore', 'No'],
       [51, 'Male', 104.0, 'Mild', 'Kolkata', 'No'],
       [65, 'Male', 99.0, 'Mild', 'Bangalore', 'No'],
       [54, 'Female', 104.0, 'Strong', 'Kolkata', 'No'],
       [73, 'Female', 103.0, 'Mild', 'Delhi', 'No'],
       [68, 'Female', 101.0, 'Strong', 'Delhi', 'No'],
       [75, 'Female', 104.0, 'Strong', 'Delhi', 'No'],
       [83, 'Female', 101.0, 'Mild', 'Kolkata', 'No'],
       [34, 'Male', 98.0, 'Strong', 'Kolkata', 'Yes'],
       [34, 'Female', 104.0, 'Strong', 'Delhi', 'No'],
       [5, 'Male', 102.0, 'Mild', 'Kolkata', 'Yes'],
       [80, 'Male', 100.0, 'Mild', 'Bangalore', 'Yes'],
       [8, 'Female', 101.0, 'Mild', 'Kolkata', 'No'],
       [11, 'Male', 100.0, 'Mild', 'Bangalore', 'Yes'],
       [48, 'Female', 103.0, 'Mild', 'Kolkata', 'Yes'],
       [14, 'Female', 99.0, 'Mild', 'Mumbai', 'Yes'],
       [65, 'Male', 99.0, 'Mild', 'Delhi', 'No'],
       [24, 'Male', 98.0, 'Mild', 'Kolkata', 'Yes'],
       [17, 'Female', 104.0, 'Mild', 'Kolkata', 'No'],
       [69, 'Female', 98.0, 'Strong', 'Mumbai', 'No'],
       [16, 'Female', 103.0, 'Mild', 'Bangalore', 'Yes'],
       [25, 'Male', 104.0, 'Mild', 'Bangalore', 'Yes'],
       [47, 'Male', 101.0, 'Strong', 'Bangalore', 'No'],
       [5, 'Female', 100.0, 'Mild', 'Kolkata', 'No'],
       [46, 'Male', 103.0, 'Strong', 'Bangalore', 'No'],
       [59, 'Female', 99.0, 'Strong', 'Delhi', 'No'],
       [38, 'Male', nan, 'Mild', 'Delhi', 'Yes'],
       [82, 'Female', 102.0, 'Strong', 'Kolkata', 'No'],
       [27, 'Male', 100.0, 'Mild', 'Kolkata', 'Yes'],
       [79, 'Male', nan, 'Strong', 'Kolkata', 'Yes'],
       [12, 'Female', 104.0, 'Mild', 'Bangalore', 'No'],
       [51, 'Female', 101.0, 'Strong', 'Kolkata', 'Yes'],
       [20, 'Female', 101.0, 'Mild', 'Bangalore', 'No'],
       [5, 'Female', 98.0, 'Strong', 'Mumbai', 'No'],
       [10, 'Female', 98.0, 'Strong', 'Kolkata', 'Yes']], dtype=object)

In [20]:
df = df.copy()

In [21]:
df = df.rank()    # rank each column default 
df

     age  gender  fever  cough  city  has_covid
0   66.5    80.0   72.0   31.5  68.5       28.0
1   36.0    80.0   34.0   31.5  41.5       78.0
2   48.0    80.0   49.0   31.5  41.5       28.0
3   38.0    30.0    9.0   31.5  68.5       28.0
4   72.5    30.0   49.0   31.5  92.5       28.0
..   ...     ...    ...    ...   ...        ...
95  10.5    30.0   83.5   31.5  15.5       28.0
96  60.0    30.0   49.0   81.5  68.5       78.0
97  25.0    30.0   49.0   31.5  15.5       28.0
98   2.0    30.0    9.0   81.5  92.5       28.0
99   6.5    30.0    9.0   81.5  68.5       78.0

[100 rows x 6 columns]

In [23]:
p = df.sort_values(by = 'fever')
p

     age  gender  fever  cough  city  has_covid
99   6.5    30.0    9.0   81.5  68.5       78.0
98   2.0    30.0    9.0   81.5  92.5       28.0
33  34.0    30.0    9.0   31.5  68.5       28.0
53  98.0    80.0    9.0   31.5  41.5       78.0
58  28.5    80.0    9.0   81.5  92.5       78.0
..   ...     ...    ...    ...   ...        ...
29  41.5    30.0    NaN   81.5  92.5       78.0
41  95.0    80.0    NaN   31.5  68.5       78.0
56  81.5    80.0    NaN   81.5  68.5       28.0
91  44.5    80.0    NaN   31.5  41.5       78.0
94  89.0    80.0    NaN   81.5  68.5       78.0

[100 rows x 6 columns]

In [24]:
q = df.sort_values(by = ['fever' , 'has_covid'])
q

     age  gender  fever  cough  city  has_covid
3   38.0    30.0    9.0   31.5  68.5       28.0
17  46.0    30.0    9.0   81.5  41.5       28.0
20  10.5    80.0    9.0   81.5  15.5       28.0
33  34.0    30.0    9.0   31.5  68.5       28.0
61  92.5    30.0    9.0   81.5  92.5       28.0
..   ...     ...    ...    ...   ...        ...
19  48.0    30.0    NaN   81.5  15.5       78.0
29  41.5    30.0    NaN   81.5  92.5       78.0
41  95.0    80.0    NaN   31.5  68.5       78.0
91  44.5    80.0    NaN   31.5  41.5       78.0
94  89.0    80.0    NaN   81.5  68.5       78.0

[100 rows x 6 columns]

In [25]:
r = df.sort_index() 
r

     age  gender  fever  cough  city  has_covid
0   66.5    80.0   72.0   31.5  68.5       28.0
1   36.0    80.0   34.0   31.5  41.5       78.0
2   48.0    80.0   49.0   31.5  41.5       28.0
3   38.0    30.0    9.0   31.5  68.5       28.0
4   72.5    30.0   49.0   31.5  92.5       28.0
..   ...     ...    ...    ...   ...        ...
95  10.5    30.0   83.5   31.5  15.5       28.0
96  60.0    30.0   49.0   81.5  68.5       78.0
97  25.0    30.0   49.0   31.5  15.5       28.0
98   2.0    30.0    9.0   81.5  92.5       28.0
99   6.5    30.0    9.0   81.5  68.5       78.0

[100 rows x 6 columns]

In [27]:
x = df.astype(float)        # type conversion 
x

     age  gender  fever  cough  city  has_covid
0   66.5    80.0   72.0   31.5  68.5       28.0
1   36.0    80.0   34.0   31.5  41.5       78.0
2   48.0    80.0   49.0   31.5  41.5       28.0
3   38.0    30.0    9.0   31.5  68.5       28.0
4   72.5    30.0   49.0   31.5  92.5       28.0
..   ...     ...    ...    ...   ...        ...
95  10.5    30.0   83.5   31.5  15.5       28.0
96  60.0    30.0   49.0   81.5  68.5       78.0
97  25.0    30.0   49.0   31.5  15.5       28.0
98   2.0    30.0    9.0   81.5  92.5       28.0
99   6.5    30.0    9.0   81.5  68.5       78.0

[100 rows x 6 columns]

In [28]:
s = df.abs() 
s

     age  gender  fever  cough  city  has_covid
0   66.5    80.0   72.0   31.5  68.5       28.0
1   36.0    80.0   34.0   31.5  41.5       78.0
2   48.0    80.0   49.0   31.5  41.5       28.0
3   38.0    30.0    9.0   31.5  68.5       28.0
4   72.5    30.0   49.0   31.5  92.5       28.0
..   ...     ...    ...    ...   ...        ...
95  10.5    30.0   83.5   31.5  15.5       28.0
96  60.0    30.0   49.0   81.5  68.5       78.0
97  25.0    30.0   49.0   31.5  15.5       28.0
98   2.0    30.0    9.0   81.5  92.5       28.0
99   6.5    30.0    9.0   81.5  68.5       78.0

[100 rows x 6 columns]

In [29]:
t = df.add(4) 
t

     age  gender  fever  cough  city  has_covid
0   70.5    84.0   76.0   35.5  72.5       32.0
1   40.0    84.0   38.0   35.5  45.5       82.0
2   52.0    84.0   53.0   35.5  45.5       32.0
3   42.0    34.0   13.0   35.5  72.5       32.0
4   76.5    34.0   53.0   35.5  96.5       32.0
..   ...     ...    ...    ...   ...        ...
95  14.5    34.0   87.5   35.5  19.5       32.0
96  64.0    34.0   53.0   85.5  72.5       82.0
97  29.0    34.0   53.0   35.5  19.5       32.0
98   6.0    34.0   13.0   85.5  96.5       32.0
99  10.5    34.0   13.0   85.5  72.5       82.0

[100 rows x 6 columns]

In [30]:
s = df.count() 
s

age          100
gender       100
fever         90
cough        100
city         100
has_covid    100
dtype: int64

In [31]:
p = df.max() 
p

age          100.0
gender        80.0
fever         83.5
cough         81.5
city          92.5
has_covid     78.0
dtype: float64

In [32]:
q = df.min() 
q

age           2.0
gender       30.0
fever         9.0
cough        31.5
city         15.5
has_covid    28.0
dtype: float64

In [33]:
r = df.mean() 
r

age          50.5
gender       50.5
fever        45.5
cough        50.5
city         50.5
has_covid    50.5
dtype: float64

In [34]:
s = df.median() 
s

age          50.5
gender       30.0
fever        49.0
cough        31.5
city         41.5
has_covid    28.0
dtype: float64

In [35]:
s = df.sum() 
s

age          5050.0
gender       5050.0
fever        4095.0
cough        5050.0
city         5050.0
has_covid    5050.0
dtype: float64

In [36]:
g = df.filter(items = ['cgpa' , 'placed'])
g

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

[100 rows x 0 columns]

In [37]:
s = df.filter(items = [5,6] , axis = 0)
s

     age  gender  fever  cough  city  has_covid
5  100.0    30.0    NaN   31.5  15.5       78.0
6   13.5    80.0   49.0   81.5  15.5       28.0

In [38]:
t = df.filter(like = '5' , axis = 0)
t

      age  gender  fever  cough  city  has_covid
5   100.0    30.0    NaN   31.5  15.5       78.0
15   80.0    80.0   72.0   81.5  68.5       78.0
25   28.5    80.0    NaN   31.5  92.5       28.0
35   95.0    30.0   62.5   81.5  15.5       28.0
45   83.0    80.0   22.5   31.5  15.5       28.0
50   21.5    80.0   49.0   31.5  41.5       78.0
51    8.5    30.0   34.0   81.5  68.5       78.0
52   52.5    30.0   34.0   81.5  15.5       78.0
53   98.0    80.0    9.0   31.5  41.5       78.0
54   66.5    30.0   22.5   31.5  92.5       78.0
55   92.5    30.0   49.0   31.5  92.5       78.0
56   81.5    80.0    NaN   81.5  68.5       28.0
57   56.0    30.0   22.5   81.5  15.5       28.0
58   28.5    80.0    9.0   81.5  92.5       78.0
59    4.0    30.0   83.5   31.5  68.5       78.0
65   78.0    30.0   62.5   31.5  15.5       28.0
75    2.0    80.0   62.5   31.5  68.5       78.0
85   16.5    30.0   72.0   31.5  15.5       78.0
95   10.5    30.0   83.5   31.5  15.5       28.0

In [39]:
s = df.to_dict()    # save in dictionary

In [40]:
q = df.to_string()    # save in string

In [41]:
idx = df.columns

In [42]:
label = df.columns[0]  # first column label 
label

'age'

In [43]:
p = df.columns.tolist()    # list of column labels 
p

['age', 'gender', 'fever', 'cough', 'city', 'has_covid']

In [44]:
q = df.columns.values    # array of column labels
q

array(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'],
      dtype=object)

In [45]:
p = df.rename(columns = {'cgpa':'half_yearly_marks' , 'resume_score':'semester_marks'})  # How to rename a column
p

     age  gender  fever  cough  city  has_covid
0   66.5    80.0   72.0   31.5  68.5       28.0
1   36.0    80.0   34.0   31.5  41.5       78.0
2   48.0    80.0   49.0   31.5  41.5       28.0
3   38.0    30.0    9.0   31.5  68.5       28.0
4   72.5    30.0   49.0   31.5  92.5       28.0
..   ...     ...    ...    ...   ...        ...
95  10.5    30.0   83.5   31.5  15.5       28.0
96  60.0    30.0   49.0   81.5  68.5       78.0
97  25.0    30.0   49.0   31.5  15.5       28.0
98   2.0    30.0    9.0   81.5  92.5       28.0
99   6.5    30.0    9.0   81.5  68.5       78.0

[100 rows x 6 columns]